РП/src/ChartsOfCharacteristicTypes/СтатьиДоходов/СтатьиДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СтатьиДоходов</name>
  <type>
    <types>CatalogRef.ОбъектыЭксплуатации</types>
    <types>DocumentRef.ЗаказПоставщику</types>
    <types>CatalogRef.НематериальныеАктивы</types>
    <types>EnumRef.АналитикаКурсовыхРазниц</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>CatalogRef.Партнеры</types>
    <types>CatalogRef.НаправленияДеятельности</types>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВыручкаОтПродаж</name>
      <description>Выручка от продаж</description>
      <code>УТ-000001</code>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </items>
    <items>
      <name>ДоходыПриВосстановленииНалоговогоКредита</name>
      <description>Доходы при восстановлении налогового кредита</description>
      <code>УТ-000009</code>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </items>
    <items>
      <name>ДоходыПриПокупкеИПродажеИностраннойВалюты</name>
      <description>Доходы при покупке и продаже иностранной валюты</description>
      <code>УТ-000007</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ЗакрытиеРезервовПоСомнительнымДолгам</name>
      <description>Закрытие резервов по сомнительным долгам</description>
      <code>УТ-000006</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>КурсовыеРазницыНеоперационные</name>
      <description>Курсовые разницы (неоперационная деятельность)</description>
      <code>УТ-000008</code>
      <type>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
      </type>
    </items>
    <items>
      <name>КурсовыеРазницы</name>
      <description>Курсовые разницы (операционная деятельность)</description>
      <code>УТ-000002</code>
      <type>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
      </type>
    </items>
    <items>
      <name>ОкруглениеНаличныхПриРозничныхПродажах</name>
      <description>Округление наличных при розничных продажах</description>
      <code>УТ-000010</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>РазницыСтоимостиВозвратаИФактическойСтоимостиТоваров</name>
      <description>Разницы стоимости возврата и фактической стоимости товаров</description>
      <code>УТ-000003</code>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </items>
    <items>
      <name>РеализацияОС</name>
      <description>Реализация ОС</description>
      <code>УТ-000004</code>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределения</name>
    <type>
      <types>CatalogRef.СпособыРаспределенияПоНаправлениямДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорыКредитовИДепозитов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоходыПоОбъектамЭксплуатации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоходыПоНМАиНИОКР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьЗаполнениеАналитики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

РП/src/ChartsOfCharacteristicTypes/СтатьиДоходов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДоговорыКредитовИДепозитов") Тогда
			ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКредитовИДепозитов");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		//++ НЕ УТ
		ДоходыПоОбъектамЭксплуатации = (ТипЗначения.СодержитТип(Тип("СправочникСсылка.ОбъектыЭксплуатации")));
		ДоходыПоНМАиНИОКР = (ТипЗначения.СодержитТип(Тип("СправочникСсылка.НематериальныеАктивы")));
		//-- НЕ УТ
		
		ДоговорыКредитовИДепозитов = ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДоговорыКредитовИДепозитов"));
		
		Если Не ПустаяСтрока(КорреспондирующийСчет) Тогда
			Если ПустаяСтрока(СтрЗаменить(КорреспондирующийСчет, ".", "")) Тогда
				КорреспондирующийСчет = "";
			ИначеЕсли Прав(СокрЛП(КорреспондирующийСчет), 1) = "." Тогда
				КорреспондирующийСчет = Лев(СокрЛП(КорреспондирующийСчет), СтрДлина(СокрЛП(КорреспондирующийСчет)) - 1);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
